app/Controllers/atualizar.php

    public function altera($id)
    {
        if(!session()->has('usuario')){
            return redirect()->to($GLOBALS['baseurl'] . '/login');
        }
       $tabela = $this->db->table('carros');
       $tabela->where('id_carro', $id);
       $carros = $tabela->get()->getResultArray();
---
SELECT *
FROM `carros`
WHERE `id_carro` = '23'