app/Controllers/criar.php

INSERT INTO `carros` (`modelo`, `marca`, `cor`, `ano`) VALUES ('camaro', 'Chevrolet', 'amarelo', '1999')
---
    public function cadastrar()
    {
        if(!session()->has('usuario')){
            return redirect()->to($GLOBALS['baseurl'] . '/login');
        }
        $tabela = $this->db->table('carros');
        $marca = $_POST['marca'];
        $modelo = $_POST['modelo'];
        $cor = $_POST['cor'];
        $ano = $_POST['ano'];
        $r = $tabela->insert(
            [
                'modelo'=>$modelo,
                'marca'=>$marca,
                'cor'=>$cor,
                'ano'=>$ano,
            ]
            );