app/Controllers/Home.php

    public function login()
    {
        $tabela = $this->db->table('usuario');
        $usuario = $this->db->table('usuario')->getWhere([ 'nome_usuario' => $_POST['nome'], 'senha_usuario' => $_POST['senha'] ])->getRowArray();
---
SELECT *
FROM `usuario`
WHERE `nome_usuario` = 'Pedro '
AND `senha_usuario` = 'Is25'