app/Controllers/remover.php

DELETE FROM `carros`
WHERE `id_carro` = '22'
---
    public function remove($id)
    {

        $tabela = $this->db->table('carros');


        $tabela->where('id_carro', $id);
        $tabela->delete();