app/Controllers/usuario.php

    public function criausuario()
    {
        $tabela = $this->db->table('usuario');
        $nome = $_POST['nome'];
        $senha = $_POST['senha'];

        $r = $tabela->insert(
            [
                'nome_usuario'=>$nome,
                'senha_usuario'=>$senha,

            ]);
---
INSERT INTO `usuario` (`nome_usuario`, `senha_usuario`, `adm`) VALUES ('carol', 'is', '1')