app/Controllers/ver.php

    public function index()
    {
        if(!session()->has('usuario')){
            return redirect()->to($GLOBALS['baseurl'] . '/login');
        }
            $msg = $erro ='';
            $tabela = $this->db->table('carros');
            $carros = $tabela->get()->getResultArray();
---
SELECT *
FROM `carros`